Server-master/myworld/src/bi_service/BiServiceSoap.InsertAccGift.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://www.ljy0.com/BiService/">
 <SOAP-ENV:Body>
   <ns1:InsertAccGiftReq>
    <ns1:RegionID>0</ns1:RegionID>
    <ns1:AccName></ns1:AccName>
    <ns1:Uin>0</ns1:Uin>
    <ns1:RoleID></ns1:RoleID>
    <ns1:InsertType>0</ns1:InsertType>
    <ns1:GiftName></ns1:GiftName>
    <ns1:GiftDesc></ns1:GiftDesc>
    <ns1:GiftItemID>0</ns1:GiftItemID>
    <ns1:GiftItemNum>0</ns1:GiftItemNum>
   </ns1:InsertAccGiftReq>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
